{
  "backend/main.mo": "Motoko backend defining user profiles and project CRUD with access control and authorization checks.",
  "feature_evidence.json": "Feature evidence report listing dark‑mode UI updates and public project page theme alignment with related files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each major frontend source file.",
  "frontend/index.css": "Global Tailwind OKLCH theme tokens for light/dark modes, including background, foreground, and component color variables.",
  "frontend/index.html": "Basic HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React app with router, authentication gating, profile setup flow, and ThemeProvider defaulting to dark mode.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with loading states and cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal requiring first‑time users to enter a display name before continuing.",
  "frontend/src/components/editor/EditorForm.tsx": "Form for editing project title, tagline, body, and theme using card components and inputs.",
  "frontend/src/components/editor/ProjectPreview.tsx": "Project content preview rendering markdown to HTML with theme‑dependent styling.",
  "frontend/src/components/editor/ThemePicker.tsx": "A theme selector component using radio buttons to choose between light, dark, or custom themes.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main app layout with header, footer, and user greeting, wrapping page content.",
  "frontend/src/components/projects/ProjectDialogs.tsx": "Contains dialogs for creating, editing, and deleting projects with form handling and mutation calls.",
  "frontend/src/components/projects/ProjectList.tsx": "Displays a grid of project cards with actions for editing, viewing, renaming, deleting, and opening projects.",
  "frontend/src/components/projects/ShareSection.tsx": "Shows a public project URL and provides a copy-to-clipboard button with feedback.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, providing login, logout, and identity context.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, projects, and project state via the backend actor.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light/dark OKLCH color variables plus base element styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/pages/Dashboard.tsx": "Displays the user's project list with create, edit, and delete dialogs.",
  "frontend/src/pages/ProjectEditor.tsx": "Provides an editor for updating, publishing, and previewing a single project.",
  "frontend/src/pages/PublicProject.tsx": "Renders a publicly accessible project page with simple markdown parsing and theme support.",
  "frontend/src/pages/SignedOut.tsx": "Landing page for signed‑out users with marketing content and login button.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters via query strings or hash.",
  "frontend/tailwind.config.js": "Tailwind configuration extending themes with OKLCH variables, custom components, and plugins.",
  "project_state.json": "Describes the project’s state, versioning, and implemented features for an app-building platform, including authentication, project dashboard, editor, preview, publishing, sharing, and theming requirements."
}